# Установил библиотеку pandas и импортировал
import pandas as pd

metro_in_town = ({"город": ["Москва", "Санкт-Петербург", "Нижний Новгород", "Новосибирск", "Самара", "Екатеринбург"],
                  "протяжённость, км": [414, 124, 22, 16, 13, 13],
                  "количество станций": [241, 72, 15, 13, 10, 9],
                  "пассажиропоток": [2560, 762, 30, 84, 13, 46]})
# Создаю таблицу из списка для дальнейшей работы
df = pd.DataFrame(metro_in_town)
print(df)
# Получаем статистическую сводку по столбцу
print(df["количество станций"].describe())
# Сортировка данных
print(df.sort_values("пассажиропоток", ascending=True))
# Фильтрация данных
print(df[df["протяжённость, км"] > 20])
